/*

Описать макрокоманду, проверяющую, входит ли переданное ей число в диапазон от нуля (включительно) до переданного ей второго аргумента (исключительно)
Описать макрокоманду, получающую доступ к элементу двумерного массива (организованного динамически) посредством разыменования указателей
* Описать макрокоманду, возвращающую количество элементов локального массива, принимающую на вход ссылку на массив и его тип



*/
#define INCL(x, y) (((x) >= 0) && ((x) <= (y))) ? printf("true\n") : printf("false\n")
#define RARR(x, y)	*(x) + y
#define inc(x, y) 	((sizeof(x)) / (sizeof(y)))
#include <iostream>


int main(){
//задание 1
	INCL(5*(-1), 5+1);
	INCL(5-5, 5+1);

//задание 2

	int *arr;
	int *g;
	arr = new int(10);

	for (int i=0; i<10 ; i++) {
		arr[i] = i * 2;
	}
	std::cout << arr[5] << std::endl;
	std::cout << *(arr + 5) << std::endl;	

	g = RARR(&arr, 9);	
	*g = 3480;

	for (int i=0; i<10 ; i++) {
		std::cout << arr[i] << std::endl;
	}	
	
//задание 3

	int ar[10];
	for (int i=0; i<10 ; i++) {
		arr[i] = i;
	}	
	std::cout << "Количество элементов массива равняется: " << inc(ar, int);
	//std::cout << sizeof(ar);
	return 0;
}


